# 欢迎使用DeerCV来书写您的完美简历

本文包含以下内容：

- 三分钟记住Markdown标记
- 如何使用简历模板
- 如何生成PDF文档
- 如何使用三次握手保障自己的隐私
- 如何通过微信发送简历

## 三分钟记住Markdown标记

Markdown是一种增强语法，但是别害怕，即使像Easy这样的脑容量不大的人也能轻松使用。事实上，绝大部分情况下，我们都只使用以下几种标记：

```
# 菜单
- 列表
![] 图片
[] 链接
```

其中唯一复杂一点的是图片，您只需要写下

![]

就像你看到的，右边预览区域会出现一个虚线框，当点击后，可以直接在线上传图片。

学会了图片的写法，链接就更加简单啦，[这里是文字](http://and-put-url-here)

## 使用简历模板

编辑器左侧，我们预置了之前在GitHub上被Star 2000多次的简历模板，您可以选择使用，需要注意的是，它会覆盖当前书写的内容，最好在您开始书写之前就选好。

![](http://tt1535-deercv.stor.sinaapp.com/55121bb0edd10.png)


## 生成PDF文件

Markdown虽然写起来很爽，但是收我们简历的同学往往没有Markdown阅读器，所以需要生成PDF格式来发送。

生成PDF可以简单地点击「输出选项」中的下载PDF，也可以在查看简历页面，点击右上方的小图标。

![](http://tt1535-deercv.stor.sinaapp.com/55121ca4d57fe.png)

## 使用三次握手保护隐私

在线简历最大的问题，就是会让别人随意看到你自己的联系方式。DeerCV引入了JobDeer引以为豪的三次握手机制来保护您的隐私。

首先，您可以在简历中用password标签把您需要保护的信息标记出来，就像下边那样。

[password]
这里是我的手机、邮箱和微信等联系方式。
[/password]

然后，您需要在左侧设置查看密码，同时勾选「 开启扫码求简历 」选项。

![](http://tt1535-deercv.stor.sinaapp.com/55121f03e091a.png)

这样，当其他人访问您的在线简历时，被保护区域会如下显示


![](http://tt1535-deercv.stor.sinaapp.com/55121fcc15c48.png)

这时候他只要「 微信扫码求简历 」，我们就会让他填一个表单，详细描述招聘信息，同时将他写的内容通过微信推送给您，您可以再手机上点击「同意」或者「拒绝」。从而只把简历显示给你中意的招聘方。

## 通过微信发送简历

有时候我们只是单纯的想把简历发给某个人，这时候您可以点击左侧「输出选项」中的，通过微信发送简历。点完后，会出来两个二维码，一个是需要阅读密码的，另外一个是不需要阅读密码的，可视需要扫描后，在微信浏览器中选择分享给朋友即可。

